In [3]:
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv("Sales Dataset1.csv")

In [5]:
data

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,27-06-2023,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,27-12-2024,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,25-07-2021,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,27-06-2023,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,27-12-2024,Connor Morgan,Illinois,Chicago,2024-12
...,...,...,...,...,...,...,...,...,...,...,...,...
1189,B-26370,8825,3594,15,Furniture,Tables,Debit Card,31-07-2024,Megan Mclean,New York,New York City,2024-07
1190,B-26298,2082,642,8,Electronics,Phones,EMI,02-06-2020,Caitlin Hunt,New York,Rochester,2020-06
1191,B-26298,2082,642,8,Electronics,Phones,EMI,15-12-2022,Jenna Holland,Texas,Austin,2022-12
1192,B-26298,2082,642,8,Electronics,Phones,EMI,07-08-2020,Stephanie Oconnell,New York,Buffalo,2020-08
1193,B-25068,914,163,13,Office Supplies,Markers,UPI,26-10-2024,Andrea Hill,Illinois,Chicago,2024-10

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [7]:
data["Profit Margin %"] = (data["Profit"] / data["Amount"]) * 100

In [8]:
data

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month,Profit Margin %
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,27-06-2023,David Padilla,Florida,Miami,2023-06,13.109192
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,27-12-2024,Connor Morgan,Illinois,Chicago,2024-12,13.109192
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,25-07-2021,Robert Stone,New York,Buffalo,2021-07,13.109192
3,B-26776,4975,1330,14,Electronics,Printers,UPI,27-06-2023,David Padilla,Florida,Miami,2023-06,26.733668
4,B-26776,4975,1330,14,Electronics,Printers,UPI,27-12-2024,Connor Morgan,Illinois,Chicago,2024-12,26.733668
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1189,B-26370,8825,3594,15,Furniture,Tables,Debit Card,31-07-2024,Megan Mclean,New York,New York City,2024-07,40.725212
1190,B-26298,2082,642,8,Electronics,Phones,EMI,02-06-2020,Caitlin Hunt,New York,Rochester,2020-06,30.835735
1191,B-26298,2082,642,8,Electronics,Phones,EMI,15-12-2022,Jenna Holland,Texas,Austin,2022-12,30.835735
1192,B-26298,2082,642,8,Electronics,Phones,EMI,07-08-2020,Stephanie Oconnell,New York,Buffalo,2020-08,30.835735
1193,B-25068,914,163,13,Office Supplies,Markers,UPI,26-10-2024,Andrea Hill,Illinois,Chicago,2024-10,17.833698

In [9]:
total = data["Amount"].sum()

In [10]:
print("Total sold amount is: ", total)

Total sold amount is:  6182639

In [11]:
profit = data["Profit"].sum()
print("total profit is : ", profit)

total profit is :  1610697

In [80]:
Overall_Profit_Margin = profit/total * 100

In [13]:
print(f"Overall Profit Margin: {Overall_Profit_Margin:.3f} %")

Overall Profit Margin: 26.052 %

In [14]:
Total_Amount_Category_wise = data.groupby("Category")["Amount"].sum()

In [15]:
Total_Amount_Category_wise

Category
Electronics        2054456
Furniture          2038673
Office Supplies    2089510
Name: Amount, dtype: int64

In [16]:
Total_Amount_Category_wise = (
    data.groupby("Category", as_index=False)["Amount"].sum()
    .sort_values("Amount", ascending=False)
)

In [17]:
Total_Amount_Category_wise

          Category   Amount
2  Office Supplies  2089510
0      Electronics  2054456
1        Furniture  2038673

In [39]:
data.groupby("Category")["Profit"].sum()

Category
Electronics        518580
Furniture          540542
Office Supplies    551575
Name: Profit, dtype: int64

In [19]:
data.groupby("Category")["Profit"].sum().sort_values(ascending=False)

Category
Office Supplies    551575
Furniture          540542
Electronics        518580
Name: Profit, dtype: int64

In [20]:
data.groupby("Category")["Profit Margin %"].mean().sort_values(ascending=False)

Category
Furniture          26.300914
Electronics        26.122300
Office Supplies    25.744971
Name: Profit Margin %, dtype: float64

In [21]:
profitandtotalcategorywise = data.groupby("Category")[["Amount", "Profit"]].sum()

In [22]:
print(" Profit and Total Category wise: ",profitandtotalcategorywise)

 Profit and Total Category wise:                    Amount  Profit
Category
Electronics      2054456  518580
Furniture        2038673  540542
Office Supplies  2089510  551575

In [23]:
profitandtotalcategorywise["Profit Margin %"] =  profitandtotalcategorywise["Profit"]/profitandtotalcategorywise["Amount"]*100
print(profitandtotalcategorywise)

                  Amount  Profit  Profit Margin %
Category
Electronics      2054456  518580        25.241718
Furniture        2038673  540542        26.514404
Office Supplies  2089510  551575        26.397337

In [24]:
profitandtotalcategorywise.sort_values(by="Profit Margin %", ascending=False)

                  Amount  Profit  Profit Margin %
Category
Furniture        2038673  540542        26.514404
Office Supplies  2089510  551575        26.397337
Electronics      2054456  518580        25.241718

In [25]:
subcat_summary = data.groupby("Sub-Category")[["Amount", "Profit"]].sum()

In [26]:
subcat_summary

                  Amount  Profit
Sub-Category
Binders           384611   97257
Bookcases         413165  118000
Chairs            431964  122892
Electronic Games  565092  148454
Laptops           419950  110260
Markers           627875  174749
Paper             524755  149723
Pens              552269  129846
Phones            503055  113607
Printers          566359  146259
Sofas             568367  142854
Tables            625177  156796

In [27]:
subcat_summary.sort_values(by=["Amount"], ascending=False)

                  Amount  Profit
Sub-Category
Markers           627875  174749
Tables            625177  156796
Sofas             568367  142854
Printers          566359  146259
Electronic Games  565092  148454
Pens              552269  129846
Paper             524755  149723
Phones            503055  113607
Chairs            431964  122892
Laptops           419950  110260
Bookcases         413165  118000
Binders           384611   97257

In [28]:
subcat_summary["Profit Margin %"] = subcat_summary["Profit"]/subcat_summary["Amount"] * 100
subcat_summary

                  Amount  Profit  Profit Margin %
Sub-Category
Binders           384611   97257        25.287108
Bookcases         413165  118000        28.560018
Chairs            431964  122892        28.449593
Electronic Games  565092  148454        26.270767
Laptops           419950  110260        26.255507
Markers           627875  174749        27.831814
Paper             524755  149723        28.531982
Pens              552269  129846        23.511369
Phones            503055  113607        22.583415
Printers          566359  146259        25.824433
Sofas             568367  142854        25.134112
Tables            625177  156796        25.080257

In [29]:
subcat_summary.sort_values(by= "Profit Margin %", ascending=False)

                  Amount  Profit  Profit Margin %
Sub-Category
Bookcases         413165  118000        28.560018
Paper             524755  149723        28.531982
Chairs            431964  122892        28.449593
Markers           627875  174749        27.831814
Electronic Games  565092  148454        26.270767
Laptops           419950  110260        26.255507
Printers          566359  146259        25.824433
Binders           384611   97257        25.287108
Sofas             568367  142854        25.134112
Tables            625177  156796        25.080257
Pens              552269  129846        23.511369
Phones            503055  113607        22.583415

In [30]:
state_wise = data.groupby("State")[["Amount", "Profit"]].sum()

In [31]:
print(state_wise)

             Amount  Profit
State
California  1086436  278814
Florida     1091174  308706
Illinois     978738  240372
New York    1130048  308506
Ohio         884768  216519
Texas       1011475  257780

In [32]:
state_wise["Profit Margin"] = state_wise["Profit"]/state_wise["Amount"]*100

In [33]:
print(state_wise["Profit Margin"])

State
California    25.663178
Florida       28.291180
Illinois      24.559382
New York      27.300256
Ohio          24.471839
Texas         25.485553
Name: Profit Margin, dtype: float64

In [34]:
state_wise.sort_values(by= "Profit Margin", ascending= False)

             Amount  Profit  Profit Margin
State
Florida     1091174  308706      28.291180
New York    1130048  308506      27.300256
California  1086436  278814      25.663178
Texas       1011475  257780      25.485553
Illinois     978738  240372      24.559382
Ohio         884768  216519      24.471839

In [35]:
state_wise.sort_values(by="Amount", ascending=False)

             Amount  Profit  Profit Margin
State
New York    1130048  308506      27.300256
Florida     1091174  308706      28.291180
California  1086436  278814      25.663178
Texas       1011475  257780      25.485553
Illinois     978738  240372      24.559382
Ohio         884768  216519      24.471839

In [36]:
state_wise.sort_values(by="Profit", ascending=False)

             Amount  Profit  Profit Margin
State
Florida     1091174  308706      28.291180
New York    1130048  308506      27.300256
California  1086436  278814      25.663178
Texas       1011475  257780      25.485553
Illinois     978738  240372      24.559382
Ohio         884768  216519      24.471839

In [37]:
data["Year-Month"].dtype

dtype('O')

In [40]:
data["Year-Month"] = pd.to_datetime(data["Year-Month"])

In [41]:
data["Year-Month"].dtype

dtype('<M8[ns]')

In [42]:
monthly_sales = data.groupby("Year-Month")[["Amount", "Profit"]].sum()

In [47]:
monthly_sales.sort_values(by="Amount", ascending= False)

            Amount  Profit
Year-Month
2022-12-01  204413   48915
2022-08-01  198965   58918
2023-07-01  181554   49391
2021-10-01  156211   34803
2022-10-01  155508   39007
...            ...     ...
2020-06-01   46900    9489
2022-11-01   42793   12750
2020-07-01   38556   12008
2020-03-01   22991    6192
2021-01-01   22187    6449

[61 rows x 2 columns]

In [48]:
monthly_sales.sort_values(by="Profit", ascending= False)

            Amount  Profit
Year-Month
2022-08-01  198965   58918
2023-07-01  181554   49391
2022-12-01  204413   48915
2022-06-01  146997   45962
2022-01-01  145619   39808
...            ...     ...
2020-07-01   38556   12008
2020-06-01   46900    9489
2024-01-01   47645    9292
2021-01-01   22187    6449
2020-03-01   22991    6192

[61 rows x 2 columns]

In [49]:
monthly_sales["Profit Margin"] = (monthly_sales["Profit"]/monthly_sales["Amount"])*100

In [51]:
monthly_sales.sort_values(by="Year-Month")

            Amount  Profit  Profit Margin
Year-Month
2020-03-01   22991    6192      26.932278
2020-04-01  133385   36156      27.106496
2020-05-01  113287   24294      21.444649
2020-06-01   46900    9489      20.232409
2020-07-01   38556   12008      31.144310
...            ...     ...            ...
2024-11-01   60976   15657      25.677316
2024-12-01   98879   20981      21.218863
2025-01-01  112906   38595      34.183303
2025-02-01   84712   28151      33.231419
2025-03-01   52198   13497      25.857313

[61 rows x 3 columns]

In [52]:
data["Order Date"] = pd.to_datetime(data["Order Date"])

C:\Users\ASUS\AppData\Local\Temp\ipykernel_17548\189678970.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data["Order Date"] = pd.to_datetime(data["Order Date"])

In [56]:
data["Year"] = data["Order Date"].dt.year

In [58]:
data["Month"] = data["Order Date"].dt.month

In [61]:
year_summary = data.groupby("Year")[["Amount", "Profit"]].sum()

In [62]:
year_summary["Profit Margin %"] = year_summary["Profit"] / year_summary["Amount"] * 100

In [63]:
year_summary

       Amount  Profit  Profit Margin %
Year
2020   859401  224103        26.076651
2021  1181446  283231        23.973250
2022  1459775  393113        26.929698
2023  1229723  321671        26.158005
2024  1202478  308336        25.641717
2025   249816   80243        32.120841

In [64]:
data["Month"] = data["Order Date"].dt.month

In [65]:
monthly_summary = data.groupby(["Year", "Month"])[["Amount", "Profit"]].sum()

In [66]:
monthly_summary["Profit Margin %"] = (monthly_summary["Profit"] / monthly_summary["Amount"] * 100)

In [67]:
monthly_summary

            Amount  Profit  Profit Margin %
Year Month
2020 3       22991    6192        26.932278
     4      133385   36156        27.106496
     5      113287   24294        21.444649
     6       46900    9489        20.232409
     7       38556   12008        31.144310
...            ...     ...              ...
2024 11      60976   15657        25.677316
     12      98879   20981        21.218863
2025 1      112906   38595        34.183303
     2       84712   28151        33.231419
     3       52198   13497        25.857313

[61 rows x 3 columns]

In [70]:
payment_summary = data.groupby("PaymentMode")[["Amount", "Profit"]].sum()

In [71]:
payment_summary["Profit Margin %"] = (payment_summary["Profit"] / payment_summary["Amount"] * 100)

In [72]:
payment_summary.sort_values(by="Amount", ascending=False)

              Amount  Profit  Profit Margin %
PaymentMode
Debit Card   1395035  375721        26.932729
Credit Card  1281044  349392        27.274005
UPI          1250473  333889        26.701016
COD          1141790  255744        22.398515
EMI          1114297  295951        26.559436

In [74]:
top_customers = (
    data.groupby("CustomerName")["Amount"]
    .sum()
    .sort_values(ascending=False)
    .head(10)
)

In [75]:
top_customers

CustomerName
Cory Evans            28557
Nicholas Anderson     27352
Emily Ellison         27352
George Foster         27352
Katherine Williams    25121
Jacqueline Harris     24433
Randy Johnson         24295
Tammy Bell            23895
Zachary Perez         23737
Brian Green           23737
Name: Amount, dtype: int64

In [76]:
data.to_excel("Sales_Analysis_Cleaned.xlsx", index=False)

In [77]:
state_wise.to_excel("State_Summary.xlsx")

In [78]:
state_wise.to_excel("State_Summary.xlsx")
subcat_summary.to_excel("SubCategory_Summary.xlsx")

In [79]:
monthly_summary.to_excel("Monthly_Summary.xlsx")